:PROPERTIES:
:ID:       95a767ae-c54b-4e55-9ca0-95b3743cbd86
:ROAM_REFS: https://en.wikipedia.org/wiki/Monte_Carlo_integration
:END:
#+TITLE: Monte Carlo integration - Wikipedia
#+AUTHOR: Chahak Mehta
#+DATE: 2021-05-14
#+PROPERTY: header-args :session montecarlo :exports both :eval no-export
#+filetags: maths monte_carlo

Monte Carlo Integration is a technique for numerical integration using random numbers. It is a type of Monte Carlo methods that can be used to numerically compute a definite integral. The main differing point of such integration is that while standard methods use a regular interval to evaluate the integrand, Monte Carlo uses a random set of points to evaluate. This method is particularly useful for higher-dimensional integrals. There are various methods to perform such an integration: Uniform sampling, stratified sampling, importance sampling, sequential Monte Carlo, and mean field particle methods. We'll be taking a look at the uniform sampling, and importance sampling methods in brief.

** Simulation
This method can be simulated fairly easily using python. Let us try and integrate the following function for \(0.8 < x < 3\)

\begin{equation*}
  f(x) = \frac{1}{1 + \sinh(2x)\log(x)^2}
\end{equation*}

To do this, we'll first have to define a python function using numpy

#+begin_src python :results output, value
  import numpy as np

  def f(x):
      return 1/(1+np.sinh(2*x)*np.log(x)**2)
#+end_src

#+RESULTS:

Now that we have a function that calculates the value of \(f(x)\) at a given set of points, let us start with the MC estimator. First we will define the limits of the integral \((a, b)\) and the number of estimators \(N\). We will also define the number of points that are sampled.

#+begin_src python :results output, value
  n_estimators = 100
  N = 100
  a, b = 0.8, 3
#+end_src

#+RESULTS:

Now, we need to perform the calculation for each MC estimator and find the average. We can do this more efficiently by using numpy's vector operations and random number generator.

#+begin_src python :results output, value
  rng = np.random.default_rng()

  r = rng.uniform(a, b, size=(n_estimators, N))
  result = (1/n_estimators)*((b-a)/N)*(np.sum(f(r)))
  result
#+end_src

#+RESULTS:
: 0.6786189790691812

We can check this result by comparing it with the function =scipy.integrate.quad=
#+begin_src python :results output, value
  from scipy import integrate

  integrate.quad(f, a, b)[0]
#+end_src

#+RESULTS:
: 0.6768400757156462

As we can see, the two results are fairly similar. Do note that the result due to MC estimators is bound to change but it is still a fairly close estimate to the integration function from scipy.

